In [1]:
!pip install seaborn==0.11.0
import pandas as pd

import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

from sklearn.svm import SVC
from sklearn.neighbors import KNeighborsClassifier

Collecting seaborn==0.11.0
  Downloading seaborn-0.11.0-py3-none-any.whl (283 kB)
     ---------------------------------------- 0.0/283.1 kB ? eta -:--:--
     ---------------- --------------------- 122.9/283.1 kB 2.4 MB/s eta 0:00:01
     -------------------------------------- 283.1/283.1 kB 2.9 MB/s eta 0:00:00
Requirement already satisfied: numpy>=1.15 in c:\users\keerthi\anaconda3\lib\site-packages (from seaborn==0.11.0) (1.24.3)
Requirement already satisfied: scipy>=1.0 in c:\users\keerthi\anaconda3\lib\site-packages (from seaborn==0.11.0) (1.11.1)
Requirement already satisfied: pandas>=0.23 in c:\users\keerthi\anaconda3\lib\site-packages (from seaborn==0.11.0) (2.0.3)
Requirement already satisfied: matplotlib>=2.2 in c:\users\keerthi\anaconda3\lib\site-packages (from seaborn==0.11.0) (3.7.2)
Requirement already satisfied: contourpy>=1.0.1 in c:\users\keerthi\anaconda3\lib\site-packages (from matplotlib>=2.2->seaborn==0.11.0) (1.0.5)
Requirement already satisfied: cycler>=0.10 in c:\users\keerthi\anaconda3\lib\site-packages (from matplotlib>=2.2->seaborn==0.11.0) (0.11.0)
Requirement already satisfied: fonttools>=4.22.0 in c:\users\keerthi\anaconda3\lib\site-packages (from matplotlib>=2.2->seaborn==0.11.0) (4.25.0)
Requirement already satisfied: kiwisolver>=1.0.1 in c:\users\keerthi\anaconda3\lib\site-packages (from matplotlib>=2.2->seaborn==0.11.0) (1.4.4)
Requirement already satisfied: packaging>=20.0 in c:\users\keerthi\anaconda3\lib\site-packages (from matplotlib>=2.2->seaborn==0.11.0) (23.1)
Requirement already satisfied: pillow>=6.2.0 in c:\users\keerthi\anaconda3\lib\site-packages (from matplotlib>=2.2->seaborn==0.11.0) (9.4.0)
Requirement already satisfied: pyparsing<3.1,>=2.3.1 in c:\users\keerthi\anaconda3\lib\site-packages (from matplotlib>=2.2->seaborn==0.11.0) (3.0.9)
Requirement already satisfied: python-dateutil>=2.7 in c:\users\keerthi\anaconda3\lib\site-packages (from matplotlib>=2.2->seaborn==0.11.0) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\keerthi\anaconda3\lib\site-packages (from pandas>=0.23->seaborn==0.11.0) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in c:\users\keerthi\anaconda3\lib\site-packages (from pandas>=0.23->seaborn==0.11.0) (2023.3)
Requirement already satisfied: six>=1.5 in c:\users\keerthi\anaconda3\lib\site-packages (from python-dateutil>=2.7->matplotlib>=2.2->seaborn==0.11.0) (1.16.0)
Installing collected packages: seaborn
  Attempting uninstall: seaborn
    Found existing installation: seaborn 0.12.2
    Uninstalling seaborn-0.12.2:
      Successfully uninstalled seaborn-0.12.2
Successfully installed seaborn-0.11.0

In [2]:
# Reading the dataset

TitanicSurvivalData=pd.read_csv(r'C:\Users\keerthi\Downloads\titanic_dataset .csv')
print('Shape before deleting duplicate values:', TitanicSurvivalData.shape)

# Removing duplicate rows if any
TitanicSurvivalData=TitanicSurvivalData.drop_duplicates()
print('Shape After deleting duplicate values:', TitanicSurvivalData.shape)

# Printing sample data
TitanicSurvivalData.head(10)

Shape before deleting duplicate values: (891, 12)
Shape After deleting duplicate values: (891, 12)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [3]:
# Deleting those columns which are not useful
UselessColumns = ['PassengerId','Name','Ticket','Cabin']
TitanicSurvivalData = TitanicSurvivalData.drop(UselessColumns,axis=1)
TitanicSurvivalData.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    male  22.0      1      0   7.2500        S
1         1       1  female  38.0      1      0  71.2833        C
2         1       3  female  26.0      0      0   7.9250        S
3         1       1  female  35.0      1      0  53.1000        S
4         0       3    male  35.0      0      0   8.0500        S

In [4]:
# Finding nearest values to 300 mark
TitanicSurvivalData['Fare'][TitanicSurvivalData['Fare']<300].sort_values(ascending=False)

27     263.000
341    263.000
438    263.000
88     263.000
742    262.375
        ...
633      0.000
413      0.000
822      0.000
732      0.000
674      0.000
Name: Fare, Length: 888, dtype: float64

In [6]:
import warnings
warnings.filterwarnings('ignore')
# Replacing outliers with nearest possibe value
TitanicSurvivalData['Fare'][TitanicSurvivalData['Fare']>300] = 263.0

In [7]:
# Finding how many missing values are there for each column
TitanicSurvivalData.isnull().sum()

Survived      0
Pclass        0
Sex           0
Age         177
SibSp         0
Parch         0
Fare          0
Embarked      2
dtype: int64

In [8]:
# Replacing missing values of Age with median value
TitanicSurvivalData['Age'].fillna(TitanicSurvivalData['Age'].median(), inplace=True)

# Replacing missing values of Embarked with Mode value
TitanicSurvivalData['Embarked'].fillna(TitanicSurvivalData['Embarked'].mode()[0], inplace=True)

In [9]:
# Checking missing values again after the treatment
TitanicSurvivalData.isnull().sum()

Survived    0
Pclass      0
Sex         0
Age         0
SibSp       0
Parch       0
Fare        0
Embarked    0
dtype: int64

In [10]:
SelectedColumns=['Pclass', 'Sex', 'SibSp', 'Parch', 'Embarked','Fare']

# Selecting final columns
DataForML=TitanicSurvivalData[SelectedColumns]
DataForML.head()

   Pclass     Sex  SibSp  Parch Embarked     Fare
0       3    male      1      0        S   7.2500
1       1  female      1      0        C  71.2833
2       3  female      0      0        S   7.9250
3       1  female      1      0        S  53.1000
4       3    male      0      0        S   8.0500

In [11]:
# Converting the binary nominal variable sex to numeric
DataForML['Sex'].replace({'female':0, 'male':1}, inplace=True)

In [12]:
# Treating all the nominal variables at once using dummy variables
DataForML_Numeric=pd.get_dummies(DataForML)

# Adding Target Variable to the data
DataForML_Numeric['Survived']=TitanicSurvivalData['Survived']

# Printing sample rows
DataForML_Numeric.head()

,Pclass,Sex,SibSp,Parch,Fare,Embarked_C,Embarked_Q,Embarked_S,Survived
0,3,1,1,0,7.2500,False,False,True,0
1,1,0,1,0,71.2833,True,False,False,1
2,3,0,0,0,7.9250,False,False,True,1
3,1,0,1,0,53.1000,False,False,True,1
4,3,1,0,0,8.0500,False,False,True,0

In [13]:
# Separate Target Variable and Predictor Variables
TargetVariable='Survived'
Predictors=['Pclass', 'Sex', 'SibSp', 'Parch', 'Fare', 'Embarked_C', 'Embarked_Q','Embarked_S']

X=DataForML_Numeric[Predictors].values
y=DataForML_Numeric[TargetVariable].values

# Split the data into training and testing set
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.3, random_state=428)

In [14]:
### Sandardization of data ###
from sklearn.preprocessing import StandardScaler, MinMaxScaler

#PredictorScaler=StandardScaler()
PredictorScaler=MinMaxScaler()

# Storing the fit object for later reference
PredictorScalerFit=PredictorScaler.fit(X)

# Generating the standardized values of X
X=PredictorScalerFit.transform(X)

# Split the data into training and testing set
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.3, random_state=42)

In [15]:
print(X_train.shape)
print(y_train.shape)
print(X_test.shape)
print(y_test.shape)

(623, 8)
(623,)
(268, 8)
(268,)

In [16]:
# K-Nearest Neighbor(KNN)
from sklearn.neighbors import KNeighborsClassifier
clf = KNeighborsClassifier(n_neighbors=4)

# Printing all the parameters of KNN
print(clf)

# Creating the model on Training Data
KNN=clf.fit(X_train,y_train)
prediction=KNN.predict(X_test)

# Measuring accuracy on Testing Data
from sklearn import metrics
print(metrics.classification_report(y_test, prediction))
print(metrics.confusion_matrix(y_test, prediction))

# Printing the Overall Accuracy of the model
F1_Score=metrics.f1_score(y_test, prediction, average='weighted')
print('Accuracy of the model on Testing Sample Data:', round(F1_Score,2))

# Importing cross validation function from sklearn
from sklearn.model_selection import cross_val_score

# Running 10-Fold Cross validation on a given algorithm
# Passing full data X and y because the K-fold will split the data and automatically choose train/test
Accuracy_Values=cross_val_score(KNN, X , y, cv=10, scoring='f1_weighted')
print('\nAccuracy values for 10-fold Cross Validation:\n',Accuracy_Values)
print('\nFinal Average Accuracy of the model:', round(Accuracy_Values.mean(),2))

KNeighborsClassifier(n_neighbors=4)
              precision    recall  f1-score   support

           0       0.75      0.92      0.83       157
           1       0.83      0.58      0.68       111

    accuracy                           0.78       268
   macro avg       0.79      0.75      0.75       268
weighted avg       0.79      0.78      0.77       268

[[144  13]
 [ 47  64]]
Accuracy of the model on Testing Sample Data: 0.77

Accuracy values for 10-fold Cross Validation:
 [0.77097382 0.77562138 0.73163495 0.84348731 0.88395861 0.75981111
 0.81221749 0.74470894 0.8284365  0.81061604]

Final Average Accuracy of the model: 0.8

In [17]:
# Support Vector Machines(SVM)
from sklearn import svm
clf = svm.SVC(C=10, kernel='rbf', gamma=0.01)

# Printing all the parameters of KNN
print(clf)

# Creating the model on Training Data
SVM=clf.fit(X_train,y_train)
prediction=SVM.predict(X_test)

# Measuring accuracy on Testing Data
from sklearn import metrics
print(metrics.classification_report(y_test, prediction))
print(metrics.confusion_matrix(y_test, prediction))

# Printing the Overall Accuracy of the model
F1_Score=metrics.f1_score(y_test, prediction, average='weighted')
print('Accuracy of the model on Testing Sample Data:', round(F1_Score,2))

# Importing cross validation function from sklearn
from sklearn.model_selection import cross_val_score

# Running 10-Fold Cross validation on a given algorithm
# Passing full data X and y because the K-fold will split the data and automatically choose train/test
Accuracy_Values=cross_val_score(SVM, X , y, cv=10, scoring='f1_weighted')
print('\nAccuracy values for 10-fold Cross Validation:\n',Accuracy_Values)
print('\nFinal Average Accuracy of the model:', round(Accuracy_Values.mean(),2))

SVC(C=10, gamma=0.01)
              precision    recall  f1-score   support

           0       0.80      0.85      0.83       157
           1       0.77      0.70      0.74       111

    accuracy                           0.79       268
   macro avg       0.79      0.78      0.78       268
weighted avg       0.79      0.79      0.79       268

[[134  23]
 [ 33  78]]
Accuracy of the model on Testing Sample Data: 0.79

Accuracy values for 10-fold Cross Validation:
 [0.8105932  0.79775281 0.75981111 0.84348731 0.7987694  0.77021909
 0.75981111 0.73447598 0.80556137 0.76195095]

Final Average Accuracy of the model: 0.78